const credibility = [
  {
    可靠性得分: 0.7792460887972007,
    鲁棒性得分: 0.4088587002370083,
    稳定性得分: 0.23019926588732342,
    透明性得分: 0.0,
    解释效果得分: 0.0,
  },

  {
    可靠性得分: 0.9999999999999999,
    鲁棒性得分: 0.0,
    稳定性得分: 0.558048361598526,
    透明性得分: 0.0,
    解释效果得分: 0.0,
  },

  {
    可靠性得分: 0.8743617477994924,
    鲁棒性得分: 1.0,
    稳定性得分: 0.5358252008904741,
    透明性得分: 0.0,
    解释效果得分: 0.0,
  },

  {
    可靠性得分: 0.0,
    鲁棒性得分: 0.00338034509560714,
    稳定性得分: 0.9999999999999999,
    透明性得分: 1.0,
    解释效果得分: 1.0,
  },

  {
    可靠性得分: 0.6618826196514279,
    鲁棒性得分: 0.04702575636056494,
    稳定性得分: 0.0,
    透明性得分: 1.0,
    解释效果得分: 0.20576075103781344,
  },

  // {
  //   可靠性得分: 0.7792460887972007,
  //   稳定性得分: 0.23019926588732342,
  //   鲁棒性得分: 0.4088587002370083,
  //   透明性得分: 0.0,
  //   解释效果得分: 0.0,
  // },

  // {
  //   可靠性得分: 0.9999999999999999,
  //   稳定性得分: 0.558048361598526,
  //   鲁棒性得分: 0.0,
  //   透明性得分: 0.0,
  //   解释效果得分: 0.0,
  // },

  // {
  //   可靠性得分: 0.8743617477994924,
  //   稳定性得分: 0.5358252008904741,
  //   鲁棒性得分: 1.0,
  //   透明性得分: 0.0,
  //   解释效果得分: 0.0,
  // },

  // {
  //   可靠性得分: 0.0,
  //   稳定性得分: 0.9999999999999999,
  //   鲁棒性得分: 0.00338034509560714,
  //   透明性得分: 1.0,
  //   解释效果得分: 1.0,
  // },

  // {
  //   可靠性得分: 0.6618826196514279,
  //   稳定性得分: 0.0,
  //   鲁棒性得分: 0.04702575636056494,
  //   透明性得分: 1.0,
  //   解释效果得分: 0.20576075103781344,
  // },
];

const stock = ['002460.SZ', '600703.SH', '300072.SZ'];

const invest = [
  {
    用户收益偏好得分: 0.0,
    用户风险偏好得分: 0.0,
    用户投资体验感得分: 1.0,
    沪深300指数比较得分: 0.0,
    中证500指数比较得分: 0.0,
    基准比较得分: 0.0,
    同行业股票比较对比得分: 0.0,
  },
  {
    用户收益偏好得分: 0.707718714340043,
    用户风险偏好得分: 0.9574665744137745,
    用户投资体验感得分: 1.0,
    沪深300指数比较得分: 0.5827729302491549,
    中证500指数比较得分: 0.5949915568244181,
    基准比较得分: 0.21022705227788202,
    同行业股票比较对比得分: 0.6715549818256178,
  },

  {
    用户收益偏好得分: 1.0,
    用户风险偏好得分: 0.0,
    用户投资体验感得分: 0.0,
    沪深300指数比较得分: 1.0,
    中证500指数比较得分: 0.9999999999999999,
    基准比较得分: 1.0,
    同行业股票比较对比得分: 1.0,
  },
  {
    用户收益偏好得分: 0.5437831689642841,
    用户风险偏好得分: 1.0,
    用户投资体验感得分: 1.0,
    沪深300指数比较得分: 0.5015445301324437,
    中证500指数比较得分: 0.542660384272348,
    基准比较得分: 0.16961341137725003,
    同行业股票比较对比得分: 1.0,
  },

  {
    用户收益偏好得分: 0.0,
    用户风险偏好得分: 0.8738174552181767,
    用户投资体验感得分: 1.0,
    沪深300指数比较得分: 0.0,
    中证500指数比较得分: 0.4604815234861957,
    基准比较得分: 0.0,
    同行业股票比较对比得分: 0.6715549818256178,
  },
  {
    用户收益偏好得分: 0.0,
    用户风险偏好得分: 0.9408411863089929,
    用户投资体验感得分: 1.0,
    沪深300指数比较得分: 0.0,
    中证500指数比较得分: 0.41763015816850213,
    基准比较得分: 0.12766255278355176,
    同行业股票比较对比得分: 1.0,
  },
];

export { credibility, invest, stock };
